"""
int - целое число 
foat - дробное число
bool - булевые переменные
str - строка

print() - вывести в консоль
input() - ввод из консоли
type() - выводит тип переменной

арефмитические операции:
1. возведение в степень **
2. умножение *
3. деление /
4. целочисленное деление //
5. остаток от деления %
6. сложение +
7. вычитание -

round(число, сколько знаком после запятой оставить)

Логические операции:
not - отрицание
and - И
or - ИЛИ

Условие в Python
if con :
# operation 1

# operation 2

# ***

# operation n
else:

# operation n + 1

# operation n + m

if условие

// инструкция

elif условие 

// инструкция

elif условие

else 
// инструкция

a = 5
b = 5.89
c = 'hello'

print("{} - {} - {}".format(a,b,c))

b = input('Введение второе число: ')

i = 0
while i < 5:

i = i + 1
else:
print('Пожалуй')
print('хватит )')
print(i)

Цикл for - испоьзуется для перебора значений 

Пример использования цикла for:

for i in enumeration:

# operation 1

# operation 2

#...

# operation n

for i in 1, -2, 3, 14, 5:
print(i)

# 1 -2 3 15 5

- RANHE - ВЫДАЁТ ЗНАЧЕНИЯ ИЗ ДИАПОЗОНА С ШАГОМ 1 
- ксли указано только одно число - от 0 до заданного числа.
- если нужен другой шаг, третьим аргументов можно задать приращение.

r = range(100,0,-20) # 0 1 2 3 4

for i in r:
print(i)   # 

Строки 

for i in 'qwerty'

print(i) // q w e r t y
lower() // 
upper() 
команда replace('еще','ЕЩЁ') 

text = 'abcd'
print(text[0]) // a 
print(text[1]) // b



"""